lvx/base/Catalogs/бит_му_РыночныеСтавкиКредитыЗаймы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_му_РыночныеСтавкиКредитыЗаймы</Name>
			<Comment>(БИТ МУ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЧислоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Catalogs/бит_му_РыночныеСтавкиКредитыЗаймы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	ЗакрыватьПриВыборе = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ВыполнитьПроверкуЗаполнения(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ОповеститьОВыборе(Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Объект.Период = НачалоМесяца(Объект.Период);
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Объект.Период = НачалоМесяца(ДобавитьМесяц(Объект.Период, Направление));
	СформироватьНаименование();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура проверят, правильно ли заполнена табличная часть.
// 
// Параметры:
//  Отказ - Булево, по умолчанию Ложь.
// 
&НаСервере
Процедура ВыполнитьПроверкуЗаполнения(Отказ)

	ТабЗнач = Объект.Ставки.Выгрузить();
	ТабЗнач.Колонки.Добавить("Счетчик");
	ТабЗнач.ЗаполнитьЗначения(1, "Счетчик");
	
	ТабЗнач.Свернуть("ЧислоДней", "Счетчик");
	
	СтрокаСообщений = "";
	
	Для каждого ТекСтр Из ТабЗнач Цикл
		Если ТекСтр.Счетчик > 1 Тогда
			СтрокаСообщений = СтрокаСообщений + НСтр("ru='число дней %1 встречается в таблице более одного раза';
													 |en='days %1 is found more than once in the table'") + Символы.ПС;
			СтрокаСообщений = СтрШаблон(СтрокаСообщений, ТекСтр.ЧислоДней);
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокаСообщений <> "" Тогда
		СтрокаСообщений = НСтр("ru='Невозможно записать элемент по причине:';
							   |en='Unable to record this element due to:'") + Символы.ПС + СтрокаСообщений;	
		ОбщегоНазначения.СообщитьПользователю(СтрокаСообщений, Объект,,, Отказ);
		Возврат;
	КонецЕсли;

КонецПроцедуры // ВыполнитьПроверкуЗаполнения() 

// Процедура формирует наименование элемента.
//
&НаКлиенте
Процедура СформироватьНаименование()
	
	СписокВыбора = Элементы.Наименование.СписокВыбора;
	СписокВыбора.Очистить();
	СписокВыбора.Добавить(Формат(Объект.Период, "ДФ='MMMM yyyy'") + ", " + Объект.Валюта);
	
КонецПроцедуры

#КонецОбласти
